
## Plan Result (aws/eks)

[CI link](https://github.com/44smkn/terraform/actions/runs/1973817781)


### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 30 to add, 2 to change, 26 to destroy.</code></pre>

* Create
  * module.eks.module.eks.aws_cloudwatch_log_group.this[0]
  * module.eks.module.eks.aws_iam_role.this[0]
  * module.eks.module.eks.aws_iam_role_policy_attachment.this[&#34;arn:aws:iam::aws:policy/AmazonEKSClusterPolicy&#34;]
  * module.eks.module.eks.aws_iam_role_policy_attachment.this[&#34;arn:aws:iam::aws:policy/AmazonEKSVPCResourceController&#34;]
  * module.eks.module.eks.aws_security_group.node[0]
  * module.eks.module.eks.aws_security_group_rule.cluster[&#34;egress_nodes_443&#34;]
  * module.eks.module.eks.aws_security_group_rule.cluster[&#34;egress_nodes_kubelet&#34;]
  * module.eks.module.eks.aws_security_group_rule.cluster[&#34;ingress_nodes_443&#34;]
  * module.eks.module.eks.aws_security_group_rule.node[&#34;egress_cluster_443&#34;]
  * module.eks.module.eks.aws_security_group_rule.node[&#34;egress_https&#34;]
  * module.eks.module.eks.aws_security_group_rule.node[&#34;egress_ntp_tcp&#34;]
  * module.eks.module.eks.aws_security_group_rule.node[&#34;egress_ntp_udp&#34;]
  * module.eks.module.eks.aws_security_group_rule.node[&#34;egress_self_coredns_tcp&#34;]
  * module.eks.module.eks.aws_security_group_rule.node[&#34;egress_self_coredns_udp&#34;]
  * module.eks.module.eks.aws_security_group_rule.node[&#34;ingress_cluster_443&#34;]
  * module.eks.module.eks.aws_security_group_rule.node[&#34;ingress_cluster_kubelet&#34;]
  * module.eks.module.eks.aws_security_group_rule.node[&#34;ingress_self_coredns_tcp&#34;]
  * module.eks.module.eks.aws_security_group_rule.node[&#34;ingress_self_coredns_udp&#34;]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_autoscaling_group.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_iam_instance_profile.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_iam_role.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_iam_role_policy_attachment.this[&#34;arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly&#34;]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_iam_role_policy_attachment.this[&#34;arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy&#34;]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_iam_role_policy_attachment.this[&#34;arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy&#34;]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_launch_template.this[0]
  * module.eks.module.eks.module.self_managed_node_group[&#34;0&#34;].aws_security_group.this[0]
* Update
  * module.eks.aws_iam_instance_profile.karpenter
  * module.eks.module.iam_assumable_role_karpenter.aws_iam_role.this[0]
* Delete
  * module.eks.module.eks.aws_autoscaling_group.workers[0]
  * module.eks.module.eks.aws_iam_instance_profile.workers[0]
  * module.eks.module.eks.aws_iam_policy.cluster_deny_log_group[0]
  * module.eks.module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0]
  * module.eks.module.eks.aws_iam_role.cluster[0]
  * module.eks.module.eks.aws_iam_role.workers[0]
  * module.eks.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0]
  * module.eks.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0]
  * module.eks.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0]
  * module.eks.module.eks.aws_iam_role_policy_attachment.cluster_deny_log_group[0]
  * module.eks.module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0]
  * module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0]
  * module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0]
  * module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0]
  * module.eks.module.eks.aws_launch_configuration.workers[0]
  * module.eks.module.eks.aws_security_group.workers[0]
  * module.eks.module.eks.aws_security_group_rule.cluster_egress_internet[0]
  * module.eks.module.eks.aws_security_group_rule.cluster_https_worker_ingress[0]
  * module.eks.module.eks.aws_security_group_rule.workers_egress_internet[0]
  * module.eks.module.eks.aws_security_group_rule.workers_ingress_cluster[0]
  * module.eks.module.eks.aws_security_group_rule.workers_ingress_cluster_https[0]
  * module.eks.module.eks.aws_security_group_rule.workers_ingress_self[0]
* Replace
  * module.eks.aws_iam_role_policy_attachment.karpenter_ssm_policy
  * module.eks.module.eks.aws_eks_cluster.this[0]
  * module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]
  * module.eks.module.eks.aws_security_group.cluster[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.eks.aws_iam_instance_profile.karpenter will be updated in-place
  ~ resource "aws_iam_instance_profile" "karpenter" {
        id          = "KarpenterNodeInstanceProfile-44smkn-test"
        name        = "KarpenterNodeInstanceProfile-44smkn-test"
      ~ role        = "44smkn-test2022031215250037830000000b" -> (known after apply)
        tags        = {}
        # (5 unchanged attributes hidden)
    }

  # module.eks.aws_iam_role_policy_attachment.karpenter_ssm_policy must be replaced
-/+ resource "aws_iam_role_policy_attachment" "karpenter_ssm_policy" {
      ~ id         = "44smkn-test2022031215250037830000000b-2022031215250261520000000e" -> (known after apply)
      ~ role       = "44smkn-test2022031215250037830000000b" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.eks.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this"  {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks.module.eks.aws_autoscaling_group.workers[0] will be destroyed
  # (because aws_autoscaling_group.workers is not in configuration)
  - resource "aws_autoscaling_group" "workers" {
      - arn                       = "arn:aws:autoscaling:ap-northeast-1:171457761414:autoScalingGroup:1fc1d329-fa8f-4865-9994-c64d3591de85:autoScalingGroupName/44smkn-test-020220312152515996500000012" -> null
      - availability_zones        = [
          - "ap-northeast-1a",
          - "ap-northeast-1c",
          - "ap-northeast-1d",
        ] -> null
      - capacity_rebalance        = false -> null
      - default_cooldown          = 300 -> null
      - desired_capacity          = 1 -> null
      - enabled_metrics           = [] -> null
      - force_delete              = false -> null
      - force_delete_warm_pool    = false -> null
      - health_check_grace_period = 300 -> null
      - health_check_type         = "EC2" -> null
      - id                        = "44smkn-test-020220312152515996500000012" -> null
      - launch_configuration      = "44smkn-test-020220312152503645800000011" -> null
      - load_balancers            = [] -> null
      - max_instance_lifetime     = 0 -> null
      - max_size                  = 1 -> null
      - metrics_granularity       = "1Minute" -> null
      - min_size                  = 1 -> null
      - name                      = "44smkn-test-020220312152515996500000012" -> null
      - name_prefix               = "44smkn-test-0" -> null
      - protect_from_scale_in     = false -> null
      - service_linked_role_arn   = "arn:aws:iam::171457761414:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling" -> null
      - suspended_processes       = [
          - "AZRebalance",
        ] -> null
      - target_group_arns         = [] -> null
      - termination_policies      = [] -> null
      - vpc_zone_identifier       = [
          - "subnet-00fd94a44b89ebb55",
          - "subnet-0916eda26f2988dc1",
          - "subnet-0f6da23e54139ede6",
        ] -> null
      - wait_for_capacity_timeout = "10m" -> null

      - tag {
          - key                 = "Name" -> null
          - propagate_at_launch = true -> null
          - value               = "44smkn-test-0-eks_asg" -> null
        }
      - tag {
          - key                 = "k8s.io/cluster/44smkn-test" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
      - tag {
          - key                 = "karpenter.sh/discovery/44smkn-test" -> null
          - propagate_at_launch = true -> null
          - value               = "1" -> null
        }
      - tag {
          - key                 = "kubernetes.io/cluster/44smkn-test" -> null
          - propagate_at_launch = true -> null
          - value               = "owned" -> null
        }
    }

  # module.eks.module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/eks/44smkn-test/cluster"
      + retention_in_days = 90
      + tags              = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + tags_all          = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
    }

  # module.eks.module.eks.aws_eks_cluster.this[0] must be replaced
+/- resource "aws_eks_cluster" "this" {
      ~ arn                       = "arn:aws:eks:ap-northeast-1:171457761414:cluster/44smkn-test" -> (known after apply)
      ~ certificate_authority     = [
          - {
              - data = "LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXhNakUxTWpJeE9Gb1hEVE15TURNd09URTFNakl4T0Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTk1WCkxXT2pOQ3BkZHE5eTFQU2pGZ1ZNMXlJYkRvUmNodSt4eXVWcDdCNW1WWXJ5T1N0MkdSUnZpNnVsWEFSbVh6a0UKL0VsUFpra0R5bloxbjlKZ0dKWlV4Vll5STFCR3JtcTB5V0hWakdtdEpvMC9ONDlpclVhbGUvbmUxUmx0YlZ4TApseGFQY3pPYTBtdFdmamZMYjlGbWN4YUdSMVRWY2JPaTB2cWZGSFBnZXp0dmdpZTQ3ZFNHQ0FpeWduQS9YL0RLCnVPL0ZEWDM4N0kzMUZyZTBvWW5YeEdSS2ZhYXFrV3d4UHI5cmJQQlJsZ0JhYWtTMXprcWRCM2tzSkRSWkRLUFkKZzZtU0lhbUoxWmdWRkltV1VXcVFjTmlmQW92YWFuQ0dSc1JBVjhPdURzaVRabllIRmhERjBwMlF5Z1dQaWVVKwpDanJ3Sk0waTFPMytkV001em9zQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZCRzNOaU9qNkQwZ0c2Q0dibWZsNmpvTkdhT21NQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCY1QxNml4d2VuQkdSQXQ1c1pCMitaLzZPOXNPY2s5SG1TcHpYbWEvY0xnNHpKTGUwQgpvTW5qa2loaXVMSVh5YXJOVkdPYUIwaktwbTJ4RDJCQzg1bGN3WG82WGRNSkoxV0FpTmRhOGM3OS9ndE10c2tQCkd2K2Y5UnV1L0RZSTZKY08wb09LMUJTZHlQcE91NHdVbStYcVM0TklyRG1kWUcyZEYrZ0FjdVowYlM0OWxISm0KcEQ5dUw5dlh2THFJaXdqY1dralBjY205Ry9QV0s2ellrbUErcS9EU2JmRkVPOU1PYWtNcnNPaitMYVJoK2FvcgpvS1BNTENmK2w0cjVEbUZzc1BlQS9WUDExV2EwNThDTGJ5aTlML0dXM1dGNERIa3NicnVNT3NJcTZzT01aOGpsCmhuQ0dDWkNNWlhySXZmdVVWeFBYc2h4ODk3cUlmK3h4a3VwTwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg=="
            },
        ] -> (known after apply)
      ~ created_at                = "2022-03-12 15:16:25.878 +0000 UTC" -> (known after apply)
      ~ enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
        ]
      ~ endpoint                  = "https://25390B9E092E5B1C298FBF9B4E411118.gr7.ap-northeast-1.eks.amazonaws.com" -> (known after apply)
      ~ id                        = "44smkn-test" -> (known after apply)
      ~ identity                  = [
          - {
              - oidc = [
                  - {
                      - issuer = "https://oidc.eks.ap-northeast-1.amazonaws.com/id/25390B9E092E5B1C298FBF9B4E411118"
                    },
                ]
            },
        ] -> (known after apply)
        name                      = "44smkn-test"
      ~ platform_version          = "eks.5" -> (known after apply)
      ~ role_arn                  = "arn:aws:iam::171457761414:role/44smkn-test20220312151609398200000001" -> (known after apply) # forces replacement
      ~ status                    = "ACTIVE" -> (known after apply)
        tags                      = {
            "karpenter.sh/discovery/44smkn-test" = "1"
        }
        # (2 unchanged attributes hidden)

      ~ kubernetes_network_config {
          ~ ip_family         = "ipv4" -> (known after apply)
          ~ service_ipv4_cidr = "172.20.0.0/16" -> (known after apply)
        }

      ~ timeouts {
          - create = "30m" -> null
          - delete = "15m" -> null
          - update = "60m" -> null
        }

      ~ vpc_config {
          ~ cluster_security_group_id = "sg-084cc94e34e3210b5" -> (known after apply)
          ~ security_group_ids        = [
              - "sg-04af610d0ec91b3f4",
            ] -> (known after apply) # forces replacement
          ~ vpc_id                    = "vpc-025c514b8cc9ebff3" -> (known after apply)
            # (4 unchanged attributes hidden)
        }
    }

  # module.eks.module.eks.aws_iam_instance_profile.workers[0] will be destroyed
  # (because aws_iam_instance_profile.workers is not in configuration)
  - resource "aws_iam_instance_profile" "workers" {
      - arn         = "arn:aws:iam::171457761414:instance-profile/44smkn-test2022031215250229510000000c" -> null
      - create_date = "2022-03-12T15:25:02Z" -> null
      - id          = "44smkn-test2022031215250229510000000c" -> null
      - name        = "44smkn-test2022031215250229510000000c" -> null
      - name_prefix = "44smkn-test" -> null
      - path        = "/" -> null
      - role        = "44smkn-test2022031215250037830000000b" -> null
      - tags        = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - tags_all    = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - unique_id   = "AIPASP25N2CDDJUGAUTZK" -> null
    }

  # module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] must be replaced
-/+ resource "aws_iam_openid_connect_provider" "oidc_provider" {
      ~ arn             = "arn:aws:iam::171457761414:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/25390B9E092E5B1C298FBF9B4E411118" -> (known after apply)
      ~ id              = "arn:aws:iam::171457761414:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/25390B9E092E5B1C298FBF9B4E411118" -> (known after apply)
        tags            = {
            "Name"                               = "44smkn-test-eks-irsa"
            "karpenter.sh/discovery/44smkn-test" = "1"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
      ~ url             = "oidc.eks.ap-northeast-1.amazonaws.com/id/25390B9E092E5B1C298FBF9B4E411118" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_iam_policy.cluster_deny_log_group[0] will be destroyed
  # (because aws_iam_policy.cluster_deny_log_group is not in configuration)
  - resource "aws_iam_policy" "cluster_deny_log_group" {
      - arn         = "arn:aws:iam::171457761414:policy/44smkn-test-deny-log-group20220312151609402800000002" -> null
      - description = "Deny CreateLogGroup" -> null
      - id          = "arn:aws:iam::171457761414:policy/44smkn-test-deny-log-group20220312151609402800000002" -> null
      - name        = "44smkn-test-deny-log-group20220312151609402800000002" -> null
      - name_prefix = "44smkn-test-deny-log-group" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "logs:CreateLogGroup"
                      - Effect   = "Deny"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPASP25N2CDK5XUMDOKO" -> null
      - tags        = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - tags_all    = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
    }

  # module.eks.module.eks.aws_iam_policy.cluster_elb_sl_role_creation[0] will be destroyed
  # (because aws_iam_policy.cluster_elb_sl_role_creation is not in configuration)
  - resource "aws_iam_policy" "cluster_elb_sl_role_creation" {
      - arn         = "arn:aws:iam::171457761414:policy/44smkn-test-elb-sl-role-creation20220312151609403300000003" -> null
      - description = "Permissions for EKS to create AWSServiceRoleForElasticLoadBalancing service-linked role" -> null
      - id          = "arn:aws:iam::171457761414:policy/44smkn-test-elb-sl-role-creation20220312151609403300000003" -> null
      - name        = "44smkn-test-elb-sl-role-creation20220312151609403300000003" -> null
      - name_prefix = "44smkn-test-elb-sl-role-creation" -> null
      - path        = "/" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "ec2:DescribeInternetGateways",
                          - "ec2:DescribeAddresses",
                          - "ec2:DescribeAccountAttributes",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - policy_id   = "ANPASP25N2CDEMVDPNGGW" -> null
      - tags        = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - tags_all    = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
    }

  # module.eks.module.eks.aws_iam_role.cluster[0] will be destroyed
  # (because aws_iam_role.cluster is not in configuration)
  - resource "aws_iam_role" "cluster" {
      - arn                   = "arn:aws:iam::171457761414:role/44smkn-test20220312151609398200000001" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "eks.amazonaws.com"
                        }
                      - Sid       = "EKSClusterAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-03-12T15:16:09Z" -> null
      - force_detach_policies = true -> null
      - id                    = "44smkn-test20220312151609398200000001" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::171457761414:policy/44smkn-test-deny-log-group20220312151609402800000002",
          - "arn:aws:iam::171457761414:policy/44smkn-test-elb-sl-role-creation20220312151609403300000003",
          - "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSServicePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "44smkn-test20220312151609398200000001" -> null
      - name_prefix           = "44smkn-test" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - tags_all              = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - unique_id             = "AROASP25N2CDOZJLR24MJ" -> null

      - inline_policy {}
    }

  # module.eks.module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "44smkn-test-cluster-"
      + path                  = "/"
      + tags                  = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + tags_all              = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.eks.aws_iam_role.workers[0] will be destroyed
  # (because aws_iam_role.workers is not in configuration)
  - resource "aws_iam_role" "workers" {
      - arn                   = "arn:aws:iam::171457761414:role/44smkn-test2022031215250037830000000b" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "ec2.amazonaws.com"
                        }
                      - Sid       = "EKSWorkerAssumeRole"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2022-03-12T15:25:00Z" -> null
      - force_detach_policies = true -> null
      - id                    = "44smkn-test2022031215250037830000000b" -> null
      - managed_policy_arns   = [
          - "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly",
          - "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy",
          - "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy",
          - "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore",
        ] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "44smkn-test2022031215250037830000000b" -> null
      - name_prefix           = "44smkn-test" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - tags_all              = {
          - "karpenter.sh/discovery/44smkn-test" = "1"
        } -> null
      - unique_id             = "AROASP25N2CDJR3IXVD4L" -> null

      - inline_policy {}
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy[0] will be destroyed
  # (because aws_iam_role_policy_attachment.cluster_AmazonEKSClusterPolicy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSClusterPolicy" {
      - id         = "44smkn-test20220312151609398200000001-20220312151611634100000004" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy" -> null
      - role       = "44smkn-test20220312151609398200000001" -> null
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy[0] will be destroyed
  # (because aws_iam_role_policy_attachment.cluster_AmazonEKSServicePolicy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSServicePolicy" {
      - id         = "44smkn-test20220312151609398200000001-20220312151611646200000007" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSServicePolicy" -> null
      - role       = "44smkn-test20220312151609398200000001" -> null
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy[0] will be destroyed
  # (because aws_iam_role_policy_attachment.cluster_AmazonEKSVPCResourceControllerPolicy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "cluster_AmazonEKSVPCResourceControllerPolicy" {
      - id         = "44smkn-test20220312151609398200000001-20220312151611643200000005" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController" -> null
      - role       = "44smkn-test20220312151609398200000001" -> null
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.cluster_deny_log_group[0] will be destroyed
  # (because aws_iam_role_policy_attachment.cluster_deny_log_group is not in configuration)
  - resource "aws_iam_role_policy_attachment" "cluster_deny_log_group" {
      - id         = "44smkn-test20220312151609398200000001-20220312151611645600000006" -> null
      - policy_arn = "arn:aws:iam::171457761414:policy/44smkn-test-deny-log-group20220312151609402800000002" -> null
      - role       = "44smkn-test20220312151609398200000001" -> null
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.cluster_elb_sl_role_creation[0] will be destroyed
  # (because aws_iam_role_policy_attachment.cluster_elb_sl_role_creation is not in configuration)
  - resource "aws_iam_role_policy_attachment" "cluster_elb_sl_role_creation" {
      - id         = "44smkn-test20220312151609398200000001-20220312151611652700000008" -> null
      - policy_arn = "arn:aws:iam::171457761414:policy/44smkn-test-elb-sl-role-creation20220312151609403300000003" -> null
      - role       = "44smkn-test20220312151609398200000001" -> null
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = (known after apply)
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly[0] will be destroyed
  # (because aws_iam_role_policy_attachment.workers_AmazonEC2ContainerRegistryReadOnly is not in configuration)
  - resource "aws_iam_role_policy_attachment" "workers_AmazonEC2ContainerRegistryReadOnly" {
      - id         = "44smkn-test2022031215250037830000000b-20220312152502627400000010" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly" -> null
      - role       = "44smkn-test2022031215250037830000000b" -> null
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy[0] will be destroyed
  # (because aws_iam_role_policy_attachment.workers_AmazonEKSWorkerNodePolicy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "workers_AmazonEKSWorkerNodePolicy" {
      - id         = "44smkn-test2022031215250037830000000b-2022031215250261170000000d" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy" -> null
      - role       = "44smkn-test2022031215250037830000000b" -> null
    }

  # module.eks.module.eks.aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy[0] will be destroyed
  # (because aws_iam_role_policy_attachment.workers_AmazonEKS_CNI_Policy is not in configuration)
  - resource "aws_iam_role_policy_attachment" "workers_AmazonEKS_CNI_Policy" {
      - id         = "44smkn-test2022031215250037830000000b-2022031215250262280000000f" -> null
      - policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy" -> null
      - role       = "44smkn-test2022031215250037830000000b" -> null
    }

  # module.eks.module.eks.aws_launch_configuration.workers[0] will be destroyed
  # (because aws_launch_configuration.workers is not in configuration)
  - resource "aws_launch_configuration" "workers" {
      - arn                              = "arn:aws:autoscaling:ap-northeast-1:171457761414:launchConfiguration:a14a1548-3400-4076-8bc9-43897e6a6938:launchConfigurationName/44smkn-test-020220312152503645800000011" -> null
      - associate_public_ip_address      = false -> null
      - ebs_optimized                    = true -> null
      - enable_monitoring                = true -> null
      - iam_instance_profile             = "44smkn-test2022031215250229510000000c" -> null
      - id                               = "44smkn-test-020220312152503645800000011" -> null
      - image_id                         = "ami-03975f2e9ba15a239" -> null
      - instance_type                    = "t3a.medium" -> null
      - name                             = "44smkn-test-020220312152503645800000011" -> null
      - name_prefix                      = "44smkn-test-0" -> null
      - security_groups                  = [
          - "sg-05cfd944aad470c98",
        ] -> null
      - user_data_base64                 = "IyEvYmluL2Jhc2ggLWUKCiMgQWxsb3cgdXNlciBzdXBwbGllZCBwcmUgdXNlcmRhdGEgY29kZQoKCiMgQm9vdHN0cmFwIGFuZCBqb2luIHRoZSBjbHVzdGVyCi9ldGMvZWtzL2Jvb3RzdHJhcC5zaCAtLWI2NC1jbHVzdGVyLWNhICdMUzB0TFMxQ1JVZEpUaUJEUlZKVVNVWkpRMEZVUlMwdExTMHRDazFKU1VNMWVrTkRRV01yWjBGM1NVSkJaMGxDUVVSQlRrSm5hM0ZvYTJsSE9YY3dRa0ZSYzBaQlJFRldUVkpOZDBWUldVUldVVkZFUlhkd2NtUlhTbXdLWTIwMWJHUkhWbnBOUWpSWVJGUkplVTFFVFhoTmFrVXhUV3BKZUU5R2IxaEVWRTE1VFVSTmQwOVVSVEZOYWtsNFQwWnZkMFpVUlZSTlFrVkhRVEZWUlFwQmVFMUxZVE5XYVZwWVNuVmFXRkpzWTNwRFEwRlRTWGRFVVZsS1MyOWFTV2gyWTA1QlVVVkNRbEZCUkdkblJWQkJSRU5EUVZGdlEyZG5SVUpCVGsxV0NreFhUMnBPUTNCa1pIRTVlVEZRVTJwR1oxWk5NWGxKWWtSdlVtTm9kU3Q0ZVhWV2NEZENOVzFXV1hKNVQxTjBNa2RTVW5acE5uVnNXRUZTYlZoNmEwVUtMMFZzVUZwcmEwUjVibG94YmpsS1owZEtXbFY0VmxsNVNURkNSM0p0Y1RCNVYwaFdha2R0ZEVwdk1DOU9ORGxwY2xWaGJHVXZibVV4VW14MFlsWjRUQXBzZUdGUVkzcFBZVEJ0ZEZkbWFtWk1ZamxHYldONFlVZFNNVlJXWTJKUGFUQjJjV1pHU0ZCblpYcDBkbWRwWlRRM1pGTkhRMEZwZVdkdVFTOVlMMFJMQ25WUEwwWkVXRE00TjBrek1VWnlaVEJ2V1c1WWVFZFNTMlpoWVhGclYzZDRVSEk1Y21KUVFsSnNaMEpoWVd0VE1YcHJjV1JDTTJ0elNrUlNXa1JMVUZrS1p6WnRVMGxoYlVveFdtZFdSa2x0VjFWWGNWRmpUbWxtUVc5MllXRnVRMGRTYzFKQlZqaFBkVVJ6YVZSYWJsbElSbWhFUmpCd01sRjVaMWRRYVdWVkt3cERhbkozU2swd2FURlBNeXRrVjAwMWVtOXpRMEYzUlVGQllVNURUVVZCZDBSbldVUldVakJRUVZGSUwwSkJVVVJCWjB0clRVRTRSMEV4VldSRmQwVkNDaTkzVVVaTlFVMUNRV1k0ZDBoUldVUldVakJQUWtKWlJVWkNSek5PYVU5cU5rUXdaMGMyUTBkaWJXWnNObXB2VGtkaFQyMU5RVEJIUTFOeFIxTkpZak1LUkZGRlFrTjNWVUZCTkVsQ1FWRkNZMVF4Tm1sNGQyVnVRa2RTUVhRMWMxcENNaXRhTHpaUE9YTlBZMnM1U0cxVGNIcFliV0V2WTB4bk5IcEtUR1V3UWdwdlRXNXFhMmxvYVhWTVNWaDVZWEpPVmtkUFlVSXdha3R3YlRKNFJESkNRemcxYkdOM1dHODJXR1JOU2tveFYwRnBUbVJoT0dNM09TOW5kRTEwYzJ0UUNrZDJLMlk1VW5WMUwwUlpTVFpLWTA4d2IwOUxNVUpUWkhsUWNFOTFOSGRWYlN0WWNWTTBUa2x5Ukcxa1dVY3laRVlyWjBGamRWb3dZbE0wT1d4SVNtMEtjRVE1ZFV3NWRsaDJUSEZKYVhkcVkxZHJhbEJqWTIwNVJ5OVFWMHMyZWxscmJVRXJjUzlFVTJKbVJrVlBPVTFQWVd0TmNuTlBhaXRNWVZKb0syRnZjZ3B2UzFCTlRFTm1LMncwY2pWRWJVWnpjMUJsUVM5V1VERXhWMkV3TlRoRFRHSjVhVGxNTDBkWE0xZEdORVJJYTNOaWNuVk5UM05KY1RaelQwMWFPR3BzQ21odVEwZERXa05OV2xoeVNYWm1kVlZXZUZCWWMyaDRPRGszY1VsbUszaDRhM1Z3VHdvdExTMHRMVVZPUkNCRFJWSlVTVVpKUTBGVVJTMHRMUzB0Q2c9PScgLS1hcGlzZXJ2ZXItZW5kcG9pbnQgJ2h0dHBzOi8vMjUzOTBCOUUwOTJFNUIxQzI5OEZCRjlCNEU0MTExMTguZ3I3LmFwLW5vcnRoZWFzdC0xLmVrcy5hbWF6b25hd3MuY29tJyAgLS1rdWJlbGV0LWV4dHJhLWFyZ3MgIiIgJzQ0c21rbi10ZXN0JwoKIyBBbGxvdyB1c2VyIHN1cHBsaWVkIHVzZXJkYXRhIGNvZGUKCg==" -> null
      - vpc_classic_link_security_groups = [] -> null

      - metadata_options {
          - http_endpoint               = "enabled" -> null
          - http_put_response_hop_limit = 1 -> null
          - http_tokens                 = "optional" -> null
        }

      - root_block_device {
          - delete_on_termination = true -> null
          - encrypted             = false -> null
          - iops                  = 0 -> null
          - throughput            = 0 -> null
          - volume_size           = 100 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # module.eks.module.eks.aws_security_group.cluster[0] must be replaced
+/- resource "aws_security_group" "cluster" {
      ~ arn                    = "arn:aws:ec2:ap-northeast-1:171457761414:security-group/sg-04af610d0ec91b3f4" -> (known after apply)
      ~ description            = "EKS cluster security group." -> "EKS cluster security group" # forces replacement
      ~ egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow cluster egress access to the Internet."
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> (known after apply)
      ~ id                     = "sg-04af610d0ec91b3f4" -> (known after apply)
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow pods to communicate with the EKS cluster API."
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-05cfd944aad470c98",
                ]
              - self             = false
              - to_port          = 443
            },
        ] -> (known after apply)
      ~ name                   = "44smkn-test20220312151614931700000009" -> (known after apply)
      ~ name_prefix            = "44smkn-test" -> "44smkn-test-cluster-" # forces replacement
      ~ owner_id               = "171457761414" -> (known after apply)
      ~ tags                   = {
          ~ "Name"                               = "44smkn-test-eks_cluster_sg" -> "44smkn-test-cluster"
            # (1 unchanged element hidden)
        }
      ~ tags_all               = {
          ~ "Name"                               = "44smkn-test-eks_cluster_sg" -> "44smkn-test-cluster"
            # (1 unchanged element hidden)
        }
        # (2 unchanged attributes hidden)
    }

  # module.eks.module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "44smkn-test-node-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                               = "44smkn-test-node"
          + "karpenter.sh/discovery/44smkn-test" = "1"
          + "kubernetes.io/cluster/44smkn-test"  = "owned"
        }
      + tags_all               = {
          + "Name"                               = "44smkn-test-node"
          + "karpenter.sh/discovery/44smkn-test" = "1"
          + "kubernetes.io/cluster/44smkn-test"  = "owned"
        }
      + vpc_id                 = "vpc-025c514b8cc9ebff3"
    }

  # module.eks.module.eks.aws_security_group.workers[0] will be destroyed
  # (because aws_security_group.workers is not in configuration)
  - resource "aws_security_group" "workers" {
      - arn                    = "arn:aws:ec2:ap-northeast-1:171457761414:security-group/sg-05cfd944aad470c98" -> null
      - description            = "Security group for all nodes in the cluster." -> null
      - egress                 = [
          - {
              - cidr_blocks      = [
                  - "0.0.0.0/0",
                ]
              - description      = "Allow nodes all egress to the Internet."
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = false
              - to_port          = 0
            },
        ] -> null
      - id                     = "sg-05cfd944aad470c98" -> null
      - ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "Allow node to communicate with each other."
              - from_port        = 0
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "-1"
              - security_groups  = []
              - self             = true
              - to_port          = 0
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane."
              - from_port        = 443
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-04af610d0ec91b3f4",
                ]
              - self             = false
              - to_port          = 443
            },
          - {
              - cidr_blocks      = []
              - description      = "Allow workers pods to receive communication from the cluster control plane."
              - from_port        = 1025
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-04af610d0ec91b3f4",
                ]
              - self             = false
              - to_port          = 65535
            },
        ] -> null
      - name                   = "44smkn-test2022031215161494850000000a" -> null
      - name_prefix            = "44smkn-test" -> null
      - owner_id               = "171457761414" -> null
      - revoke_rules_on_delete = false -> null
      - tags                   = {
          - "Name"                               = "44smkn-test-eks_worker_sg"
          - "karpenter.sh/discovery/44smkn-test" = "1"
          - "kubernetes.io/cluster/44smkn-test"  = "owned"
        } -> null
      - tags_all               = {
          - "Name"                               = "44smkn-test-eks_worker_sg"
          - "karpenter.sh/discovery/44smkn-test" = "1"
          - "kubernetes.io/cluster/44smkn-test"  = "owned"
        } -> null
      - vpc_id                 = "vpc-025c514b8cc9ebff3" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.module.eks.aws_security_group_rule.cluster["egress_nodes_kubelet"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "egress"
    }

  # module.eks.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.module.eks.aws_security_group_rule.cluster_egress_internet[0] will be destroyed
  # (because aws_security_group_rule.cluster_egress_internet is not in configuration)
  - resource "aws_security_group_rule" "cluster_egress_internet" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "Allow cluster egress access to the Internet." -> null
      - from_port         = 0 -> null
      - id                = "sgrule-1894582062" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-04af610d0ec91b3f4" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.cluster_https_worker_ingress[0] will be destroyed
  # (because aws_security_group_rule.cluster_https_worker_ingress is not in configuration)
  - resource "aws_security_group_rule" "cluster_https_worker_ingress" {
      - cidr_blocks              = [] -> null
      - description              = "Allow pods to communicate with the EKS cluster API." -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-1143060696" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-04af610d0ec91b3f4" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-05cfd944aad470c98" -> null
      - to_port                  = 443 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_https"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress all HTTPS to internet"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_ntp_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/TCP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_ntp_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Egress NTP/UDP to internet"
      + from_port                = 123
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks.module.eks.aws_security_group_rule.node["egress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + prefix_list_ids          = []
      + protocol                 = "udp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks.module.eks.aws_security_group_rule.workers_egress_internet[0] will be destroyed
  # (because aws_security_group_rule.workers_egress_internet is not in configuration)
  - resource "aws_security_group_rule" "workers_egress_internet" {
      - cidr_blocks       = [
          - "0.0.0.0/0",
        ] -> null
      - description       = "Allow nodes all egress to the Internet." -> null
      - from_port         = 0 -> null
      - id                = "sgrule-1340367216" -> null
      - ipv6_cidr_blocks  = [] -> null
      - prefix_list_ids   = [] -> null
      - protocol          = "-1" -> null
      - security_group_id = "sg-05cfd944aad470c98" -> null
      - self              = false -> null
      - to_port           = 0 -> null
      - type              = "egress" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.workers_ingress_cluster[0] will be destroyed
  # (because aws_security_group_rule.workers_ingress_cluster is not in configuration)
  - resource "aws_security_group_rule" "workers_ingress_cluster" {
      - cidr_blocks              = [] -> null
      - description              = "Allow workers pods to receive communication from the cluster control plane." -> null
      - from_port                = 1025 -> null
      - id                       = "sgrule-3616806585" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-05cfd944aad470c98" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-04af610d0ec91b3f4" -> null
      - to_port                  = 65535 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.workers_ingress_cluster_https[0] will be destroyed
  # (because aws_security_group_rule.workers_ingress_cluster_https is not in configuration)
  - resource "aws_security_group_rule" "workers_ingress_cluster_https" {
      - cidr_blocks              = [] -> null
      - description              = "Allow pods running extension API servers on port 443 to receive communication from cluster control plane." -> null
      - from_port                = 443 -> null
      - id                       = "sgrule-3934241831" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "tcp" -> null
      - security_group_id        = "sg-05cfd944aad470c98" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-04af610d0ec91b3f4" -> null
      - to_port                  = 443 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.module.eks.aws_security_group_rule.workers_ingress_self[0] will be destroyed
  # (because aws_security_group_rule.workers_ingress_self is not in configuration)
  - resource "aws_security_group_rule" "workers_ingress_self" {
      - cidr_blocks              = [] -> null
      - description              = "Allow node to communicate with each other." -> null
      - from_port                = 0 -> null
      - id                       = "sgrule-4266792376" -> null
      - ipv6_cidr_blocks         = [] -> null
      - prefix_list_ids          = [] -> null
      - protocol                 = "-1" -> null
      - security_group_id        = "sg-05cfd944aad470c98" -> null
      - self                     = false -> null
      - source_security_group_id = "sg-05cfd944aad470c98" -> null
      - to_port                  = 0 -> null
      - type                     = "ingress" -> null
    }

  # module.eks.module.iam_assumable_role_karpenter.data.aws_iam_policy_document.assume_role_with_oidc[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role_with_oidc"  {
      ~ id      = "1795966861" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.ap-northeast-1.amazonaws.com/id/25390B9E092E5B1C298FBF9B4E411118:sub = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::171457761414:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/25390B9E092E5B1C298FBF9B4E411118"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          ~ actions       = [
              - "sts:AssumeRoleWithWebIdentity",
            ] -> (known after apply)
          ~ effect        = "Allow" -> (known after apply)
          ~ not_actions   = [] -> (known after apply)
          ~ not_resources = [] -> (known after apply)
          ~ resources     = [] -> (known after apply)
          + sid           = (known after apply)

          - condition {
              - test     = "StringEquals" -> null
              - values   = [
                  - "system:serviceaccount:karpenter:karpenter",
                ] -> null
              - variable = "oidc.eks.ap-northeast-1.amazonaws.com/id/25390B9E092E5B1C298FBF9B4E411118:sub" -> null
            }
          + condition {
              + test     = (known after apply)
              + values   = (known after apply)
              + variable = (known after apply)
            }

          + not_principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }

          + principals {
              + identifiers = (known after apply)
              + type        = (known after apply)
            }
          - principals {
              - identifiers = [
                  - "arn:aws:iam::171457761414:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/25390B9E092E5B1C298FBF9B4E411118",
                ] -> null
              - type        = "Federated" -> null
            }
        }
    }

  # module.eks.module.iam_assumable_role_karpenter.aws_iam_role.this[0] will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRoleWithWebIdentity"
                      - Condition = {
                          - StringEquals = {
                              - oidc.eks.ap-northeast-1.amazonaws.com/id/25390B9E092E5B1C298FBF9B4E411118:sub = "system:serviceaccount:karpenter:karpenter"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Federated = "arn:aws:iam::171457761414:oidc-provider/oidc.eks.ap-northeast-1.amazonaws.com/id/25390B9E092E5B1C298FBF9B4E411118"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "karpenter-controller-44smkn-test"
        name                  = "karpenter-controller-44smkn-test"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_autoscaling_group.this[0] will be created
  + resource "aws_autoscaling_group" "this" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 1
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 3
      + metrics_granularity       = "1Minute"
      + min_size                  = 0
      + name                      = (known after apply)
      + name_prefix               = "karpenter-controller-"
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-00fd94a44b89ebb55",
          + "subnet-0916eda26f2988dc1",
          + "subnet-0f6da23e54139ede6",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "karpenter-controller"
        }
      + tag {
          + key                 = "k8s.io/cluster/44smkn-test"
          + propagate_at_launch = true
          + value               = "owned"
        }
      + tag {
          + key                 = "karpenter.sh/discovery/44smkn-test"
          + propagate_at_launch = true
          + value               = "1"
        }
      + tag {
          + key                 = "kubernetes.io/cluster/44smkn-test"
          + propagate_at_launch = true
          + value               = "owned"
        }

      + timeouts {}
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_iam_instance_profile.this[0] will be created
  + resource "aws_iam_instance_profile" "this" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "karpenter-controller-node-group-"
      + path        = "/"
      + role        = (known after apply)
      + tags        = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + tags_all    = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + unique_id   = (known after apply)
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = "EKSNodeAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Self managed node group IAM role"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "karpenter-controller-node-group-"
      + path                  = "/"
      + tags                  = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + tags_all              = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for karpenter-controller self managed node group"
      + id                     = (known after apply)
      + image_id               = "ami-03975f2e9ba15a239"
      + instance_type          = "t3a.medium"
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "karpenter-controller-"
      + tags                   = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + tags_all               = {
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + update_default_version = true
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }

      + monitoring {
          + enabled = true
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Name"                               = "karpenter-controller"
              + "karpenter.sh/discovery/44smkn-test" = "1"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Name"                               = "karpenter-controller"
              + "karpenter.sh/discovery/44smkn-test" = "1"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Name"                               = "karpenter-controller"
              + "karpenter.sh/discovery/44smkn-test" = "1"
            }
        }
    }

  # module.eks.module.eks.module.self_managed_node_group["0"].aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Self managed node group security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "karpenter-controller-node-group-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"                               = "karpenter-controller-node-group"
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + tags_all               = {
          + "Name"                               = "karpenter-controller-node-group"
          + "karpenter.sh/discovery/44smkn-test" = "1"
        }
      + vpc_id                 = "vpc-025c514b8cc9ebff3"
    }

Plan: 30 to add, 2 to change, 26 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.eks.module.eks.local_file.kubeconfig[0] has been deleted
  - resource "local_file" "kubeconfig" {
      - content              = <<-EOT
            apiVersion: v1
            preferences: {}
            kind: Config
            
            clusters:
            - cluster:
                server: https://25390B9E092E5B1C298FBF9B4E411118.gr7.ap-northeast-1.eks.amazonaws.com
                certificate-authority-data: LS0tLS1CRUdJTiBDRVJUSUZJQ0FURS0tLS0tCk1JSUM1ekNDQWMrZ0F3SUJBZ0lCQURBTkJna3Foa2lHOXcwQkFRc0ZBREFWTVJNd0VRWURWUVFERXdwcmRXSmwKY201bGRHVnpNQjRYRFRJeU1ETXhNakUxTWpJeE9Gb1hEVE15TURNd09URTFNakl4T0Zvd0ZURVRNQkVHQTFVRQpBeE1LYTNWaVpYSnVaWFJsY3pDQ0FTSXdEUVlKS29aSWh2Y05BUUVCQlFBRGdnRVBBRENDQVFvQ2dnRUJBTk1WCkxXT2pOQ3BkZHE5eTFQU2pGZ1ZNMXlJYkRvUmNodSt4eXVWcDdCNW1WWXJ5T1N0MkdSUnZpNnVsWEFSbVh6a0UKL0VsUFpra0R5bloxbjlKZ0dKWlV4Vll5STFCR3JtcTB5V0hWakdtdEpvMC9ONDlpclVhbGUvbmUxUmx0YlZ4TApseGFQY3pPYTBtdFdmamZMYjlGbWN4YUdSMVRWY2JPaTB2cWZGSFBnZXp0dmdpZTQ3ZFNHQ0FpeWduQS9YL0RLCnVPL0ZEWDM4N0kzMUZyZTBvWW5YeEdSS2ZhYXFrV3d4UHI5cmJQQlJsZ0JhYWtTMXprcWRCM2tzSkRSWkRLUFkKZzZtU0lhbUoxWmdWRkltV1VXcVFjTmlmQW92YWFuQ0dSc1JBVjhPdURzaVRabllIRmhERjBwMlF5Z1dQaWVVKwpDanJ3Sk0waTFPMytkV001em9zQ0F3RUFBYU5DTUVBd0RnWURWUjBQQVFIL0JBUURBZ0trTUE4R0ExVWRFd0VCCi93UUZNQU1CQWY4d0hRWURWUjBPQkJZRUZCRzNOaU9qNkQwZ0c2Q0dibWZsNmpvTkdhT21NQTBHQ1NxR1NJYjMKRFFFQkN3VUFBNElCQVFCY1QxNml4d2VuQkdSQXQ1c1pCMitaLzZPOXNPY2s5SG1TcHpYbWEvY0xnNHpKTGUwQgpvTW5qa2loaXVMSVh5YXJOVkdPYUIwaktwbTJ4RDJCQzg1bGN3WG82WGRNSkoxV0FpTmRhOGM3OS9ndE10c2tQCkd2K2Y5UnV1L0RZSTZKY08wb09LMUJTZHlQcE91NHdVbStYcVM0TklyRG1kWUcyZEYrZ0FjdVowYlM0OWxISm0KcEQ5dUw5dlh2THFJaXdqY1dralBjY205Ry9QV0s2ellrbUErcS9EU2JmRkVPOU1PYWtNcnNPaitMYVJoK2FvcgpvS1BNTENmK2w0cjVEbUZzc1BlQS9WUDExV2EwNThDTGJ5aTlML0dXM1dGNERIa3NicnVNT3NJcTZzT01aOGpsCmhuQ0dDWkNNWlhySXZmdVVWeFBYc2h4ODk3cUlmK3h4a3VwTwotLS0tLUVORCBDRVJUSUZJQ0FURS0tLS0tCg==
              name: eks_44smkn-test
            
            contexts:
            - context:
                cluster: eks_44smkn-test
                user: eks_44smkn-test
              name: eks_44smkn-test
            
            current-context: eks_44smkn-test
            
            users:
            - name: eks_44smkn-test
              user:
                exec:
                  apiVersion: client.authentication.k8s.io/v1alpha1
                  command: aws-iam-authenticator
                  args:
                    - "token"
                    - "-i"
                    - "44smkn-test"
        EOT -> null
      - directory_permission = "0755" -> null
      - file_permission      = "0600" -> null
      - filename             = "./kubeconfig_44smkn-test" -> null
      - id                   = "0890b48d34cbe3a4ba407af709969efb84dfe5fa" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","JobName":"terraform-plan","PRNumber":21,"Program":"tfcmt","SHA1":"5c6554311aa131755de6ce2295552e861f6576d4","Target":"aws/eks","Vars":{},"WorkflowName":"test"} -->